# int - целое число (Например 5)
# float - не целое (Например 4,5)
# bool - если нужно только True или False
# str - символы (Например a,b,c,d)
# a//b - при делении a на b символы // позволяют отбросить знаки после запятой (Например 10/6 выдаст не 1,66666, а просто 1)
# a % b - выводит остаток от деления (Например 10/6, остаток будет 4)
# \n - переносит на новую стоку
# len - определяет длинну строчки или массива, какое кол-во символов в строке или какое кол-во символов в массиве
# a[3] - если хотим получить 3й символ в строке
# a[0:2] - если хочу получить с 0 по 2 символ, не включительно, выведит только 0 и 1 символы
# a[-1] - выведит последний символ
# a[::-1] - выведит всё кроме первого символа
# a[0:5:2] - выведит  с первого символа по пятный не включительно с шагом 2, т.е. перескакивая, 1,3,5 символы